{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_8", "layers": [{"class_name": "Dense", "config": {"activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 98, "bias_constraint": null, "dtype": "float32", "trainable": true, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 2], "bias_regularizer": null, "activity_regularizer": null, "name": "dense_22", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 9, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_23", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_24", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null}}]}, "keras_version": "2.2.4"}