{"backend": "tensorflow", "config": {"layers": [{"config": {"activity_regularizer": null, "bias_regularizer": null, "name": "dense_10", "bias_constraint": null, "use_bias": true, "batch_input_shape": [null, 2], "activation": "sigmoid", "dtype": "float32", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "units": 2, "name": "dense_11", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "units": 1, "name": "dense_12", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}], "name": "sequential_4"}, "class_name": "Sequential", "keras_version": "2.2.4"}