{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_constraint": null, "use_bias": true, "batch_input_shape": [null, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "units": 18, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "name": "dense_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "bias_regularizer": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "name": "dense_2"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 14, "bias_regularizer": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "name": "dense_3"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "name": "dense_4"}}], "name": "sequential_1"}}