{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"activation": "sigmoid", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "units": 20, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "name": "dense_1", "batch_input_shape": [null, 2], "bias_constraint": null}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "units": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_3", "bias_constraint": null}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_4", "bias_constraint": null}}]}, "keras_version": "2.2.4", "backend": "tensorflow"}