{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"name": "dense_1", "activation": "sigmoid", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 2], "units": 19, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "activation": "sigmoid", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "units": 15, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "activation": "sigmoid", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "units": 8, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_4", "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "units": 1, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "class_name": "Sequential"}