{"config": {"name": "sequential_1", "layers": [{"config": {"activation": "sigmoid", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 2], "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "units": 17, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 3, "activity_regularizer": null, "name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 7, "activity_regularizer": null, "name": "dense_3", "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 1, "activity_regularizer": null, "name": "dense_4", "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}