{"config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 2], "bias_regularizer": null, "units": 19, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 14, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "name": "dense_2", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 20, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "name": "dense_3", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 1, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "dense_4", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}