{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 2], "activation": "sigmoid", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "units": 18, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "units": 7, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "name": "dense_2", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "units": 18, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "name": "dense_3", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "units": 1, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "name": "dense_4", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}}