{"config": {"name": "sequential_1", "layers": [{"config": {"name": "dense_1", "units": 89, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "batch_input_shape": [null, 2], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"name": "dense_2", "units": 91, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "units": 11, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_4", "units": 1, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}