{"config": {"name": "sequential_1", "layers": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "units": 17, "batch_input_shape": [null, 2], "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "units": 20, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "units": 7, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "units": 4, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "units": 1, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}