{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 2], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "activation": "sigmoid", "trainable": true, "bias_constraint": null, "units": 20, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "trainable": true, "bias_constraint": null, "units": 2, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dense_3", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "trainable": true, "bias_constraint": null, "units": 5, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dense_4", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "bias_constraint": null, "units": 1, "use_bias": true}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4"}