{"config": {"layers": [{"config": {"dtype": "float32", "bias_regularizer": null, "units": 20, "bias_constraint": null, "activation": "sigmoid", "batch_input_shape": [null, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 2, "bias_constraint": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 5, "bias_constraint": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_3", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 1, "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_4", "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}