{"config": {"layers": [{"config": {"trainable": true, "activation": "sigmoid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 20, "name": "dense_1", "batch_input_shape": [null, 2], "kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 12, "name": "dense_2", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "name": "dense_3", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 12, "name": "dense_4", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "name": "dense_5", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}