{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "sigmoid", "trainable": true, "units": 14, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "batch_input_shape": [null, 2], "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "sigmoid", "trainable": true, "units": 5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "sigmoid", "trainable": true, "units": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_3", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "sigmoid", "trainable": true, "units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_4", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "sigmoid", "trainable": true, "units": 5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_5", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "linear", "trainable": true, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_6", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null}}]}}