{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 20, "activity_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dtype": "float32", "batch_input_shape": [null, 2], "name": "dense_1", "use_bias": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 2, "activity_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 5, "activity_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 1, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "use_bias": true}}], "name": "sequential_1"}, "backend": "tensorflow"}