{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Dense", "config": {"dtype": "float32", "batch_input_shape": [null, 2], "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "units": 20}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "units": 18}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "units": 1}}], "name": "sequential_1"}}