{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"dtype": "float32", "activation": "sigmoid", "units": 1, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "batch_input_shape": [null, 2], "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "units": 2, "bias_regularizer": null, "name": "dense_2", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "units": 1, "bias_regularizer": null, "name": "dense_3", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_regularizer": null}}]}}