{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_2", "layers": [{"class_name": "Dense", "config": {"dtype": "float32", "name": "dense_3", "units": 9, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "sigmoid", "trainable": true, "batch_input_shape": [null, 2], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "trainable": true, "units": 1, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null}}]}, "class_name": "Sequential"}