{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 11, "activation": "sigmoid", "name": "dense_1", "batch_input_shape": [null, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 1, "activation": "sigmoid", "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 9, "activation": "sigmoid", "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 9, "activation": "sigmoid", "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 15, "activation": "sigmoid", "name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 1, "activation": "linear", "name": "dense_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null}}]}}