{"config": {"name": "sequential_2", "layers": [{"config": {"name": "dense_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "batch_input_shape": [null, 2], "kernel_constraint": null, "dtype": "float32", "units": 98, "activity_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 10, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 77, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_8", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 1, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "linear", "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}