{"config": {"name": "sequential_157", "layers": [{"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "units": 20, "batch_input_shape": [null, 2], "activation": "sigmoid", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_641", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 6, "activation": "sigmoid", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "name": "dense_642", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 4, "activation": "sigmoid", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "name": "dense_643", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 8, "activation": "sigmoid", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "name": "dense_644", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 1, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "name": "dense_645", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}