{"config": {"layers": [{"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 2], "units": 16, "trainable": true, "activation": "sigmoid", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "units": 1, "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}