{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "batch_input_shape": [null, 2], "units": 9, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "units": 1, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true}}], "name": "sequential_1"}, "backend": "tensorflow"}