{"config": {"layers": [{"config": {"kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_1", "activation": "sigmoid", "bias_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 2], "activity_regularizer": null, "use_bias": true, "units": 19}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_2", "activation": "sigmoid", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 7}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_3", "activation": "sigmoid", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 6}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_4", "activation": "sigmoid", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 5}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_5", "activation": "sigmoid", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 5}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_6", "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 1}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}