{"config": {"name": "sequential_1", "layers": [{"config": {"use_bias": true, "name": "dense_1", "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 2], "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 8, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"use_bias": true, "name": "dense_2", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "sigmoid", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 2, "trainable": true}, "class_name": "Dense"}, {"config": {"use_bias": true, "name": "dense_3", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "sigmoid", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 5, "trainable": true}, "class_name": "Dense"}, {"config": {"use_bias": true, "name": "dense_4", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 1, "trainable": true}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}