{"config": {"name": "sequential_1", "layers": [{"config": {"dtype": "float32", "units": 2, "batch_input_shape": [null, 2], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"units": 2, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"units": 1, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_3", "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}