{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "batch_input_shape": [null, 2], "dtype": "float32", "units": 9, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null, "units": 6, "kernel_constraint": null, "trainable": true, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "dense_3", "bias_regularizer": null, "kernel_regularizer": null, "units": 4, "kernel_constraint": null, "trainable": true, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "dense_4", "bias_regularizer": null, "kernel_regularizer": null, "units": 3, "kernel_constraint": null, "trainable": true, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "dense_5", "bias_regularizer": null, "kernel_regularizer": null, "units": 1, "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}, "backend": "tensorflow"}