{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "batch_input_shape": [null, 2], "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "name": "dense_9", "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "activation": "sigmoid", "name": "dense_10", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 2}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "dense_11", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 1}}], "name": "sequential_4"}, "backend": "tensorflow"}