{"class_name": "Sequential", "config": {"name": "sequential_152", "layers": [{"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "units": 5, "dtype": "float32", "name": "dense_573", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "batch_input_shape": [null, 2], "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "units": 5, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "use_bias": true, "name": "dense_574", "kernel_constraint": null, "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "units": 5, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "use_bias": true, "name": "dense_575", "kernel_constraint": null, "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "units": 1, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "use_bias": true, "name": "dense_576", "kernel_constraint": null, "activation": "linear"}}]}, "keras_version": "2.2.4", "backend": "tensorflow"}