{"keras_version": "2.2.4", "config": {"layers": [{"config": {"bias_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 2], "trainable": true, "name": "dense_1", "units": 2, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "sigmoid", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_2", "bias_constraint": null, "units": 1, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow"}